In [2]:
import pandas as pd
import numpy as np
import json
import geopandas
from shapely.geometry import Point

In [3]:
df=pd.read_csv("taxi_revised.csv")
df.head(3)

,Unnamed: 0,VendorID,pickup_longitude,pickup_latitude,total_amount,city,region
0,0,2,-73.993896,40.750111,17.05,New York,NY
1,1,1,-74.001648,40.724243,17.80,New York,NY
2,2,1,-73.963341,40.802788,10.80,New York,NY

In [4]:
df=df.iloc[:, [1,2,3,4,5,6]]

In [5]:
df.shape

(12748986, 6)

In [6]:
df_js=df[0:500]

In [7]:
df_js.shape

(500, 6)

In [9]:
df_js.to_json("Taxi_pickup2.json", orient='records')

In [11]:
df_js.head(3)

   VendorID  pickup_longitude  pickup_latitude  total_amount      city region
0         2        -73.993896        40.750111         17.05  New York     NY
1         1        -74.001648        40.724243         17.80  New York     NY
2         1        -73.963341        40.802788         10.80  New York     NY

In [19]:
df['lon']=pd.to_numeric(df['pickup_longitude'], errors='raise')
df['lat']=pd.to_numeric(df['pickup_latitude'], errors='raise')

In [20]:
df.head(3)

,VendorID,pickup_longitude,pickup_latitude,total_amount,city,region,lat,lon
0,2,-73.993896,40.750111,17.05,New York,NY,40.750111,-73.993896
1,1,-74.001648,40.724243,17.80,New York,NY,40.724243,-74.001648
2,1,-73.963341,40.802788,10.80,New York,NY,40.802788,-73.963341

In [50]:
df["point"]=list(zip(df.lon, df.lat))

In [51]:
df.head(3)

,VendorID,pickup_longitude,pickup_latitude,total_amount,city,region,lat,lon,Coordinates,point
0,2,-73.993896,40.750111,17.05,New York,NY,40.750111,-73.993896,"(40.7501106262207, -73.993896484375)","(-73.993896484375, 40.7501106262207)"
1,1,-74.001648,40.724243,17.80,New York,NY,40.724243,-74.001648,"(40.7242431640625, -74.00164794921875)","(-74.00164794921875, 40.7242431640625)"
2,1,-73.963341,40.802788,10.80,New York,NY,40.802788,-73.963341,"(40.80278778076172, -73.96334075927734)","(-73.96334075927734, 40.80278778076172)"

In [52]:
ds=df.iloc[:,[0,3,4,5,9]]

In [53]:
ds.head(3)

,VendorID,total_amount,city,region,point
0,2,17.05,New York,NY,"(-73.993896484375, 40.7501106262207)"
1,1,17.80,New York,NY,"(-74.00164794921875, 40.7242431640625)"
2,1,10.80,New York,NY,"(-73.96334075927734, 40.80278778076172)"

In [54]:
ds.shape

(12748986, 5)

In [55]:
dfs=ds[0:500]
dfs.shape

(500, 5)

In [56]:
dfs.to_json("Taxi_Pickup.json",orient='records')

In [3]:
js=pd.read_json("cities.json")

In [4]:
js.head(3)

,city,growth_from_2000_to_2013,latitude,longitude,population,rank,state
0,New York,4.8%,40.712784,-74.005941,8405837,1,New York
1,Los Angeles,4.8%,34.052234,-118.243685,3884307,2,California
2,Chicago,-6.1%,41.878114,-87.629798,2718782,3,Illinois

In [7]:
js['lon']=pd.to_numeric(js['longitude'], errors='raise')
js['lat']=pd.to_numeric(js['latitude'], errors='raise')

In [8]:
js.head(3)

,city,growth_from_2000_to_2013,latitude,longitude,population,rank,state,lon,lat
0,New York,4.8%,40.712784,-74.005941,8405837,1,New York,-74.005941,40.712784
1,Los Angeles,4.8%,34.052234,-118.243685,3884307,2,California,-118.243685,34.052234
2,Chicago,-6.1%,41.878114,-87.629798,2718782,3,Illinois,-87.629798,41.878114

In [9]:
js["point"]=list(zip(js.lon, js.lat))

In [10]:
js.head(3)

,city,growth_from_2000_to_2013,latitude,longitude,population,rank,state,lon,lat,point
0,New York,4.8%,40.712784,-74.005941,8405837,1,New York,-74.005941,40.712784,"(-74.0059413, 40.7127837)"
1,Los Angeles,4.8%,34.052234,-118.243685,3884307,2,California,-118.243685,34.052234,"(-118.2436849, 34.0522342)"
2,Chicago,-6.1%,41.878114,-87.629798,2718782,3,Illinois,-87.629798,41.878114,"(-87.6297982, 41.8781136)"

In [11]:
js=js.iloc[:,[0,4,5,6,9]]

In [12]:
js.head(3)

          city  population  rank       state                       point
0     New York     8405837     1    New York   (-74.0059413, 40.7127837)
1  Los Angeles     3884307     2  California  (-118.2436849, 34.0522342)
2      Chicago     2718782     3    Illinois   (-87.6297982, 41.8781136)

In [13]:
js.to_json("us_city.json",orient='records')

In [15]:
jsd=js[0:50]
jsd.shape

(50, 5)

In [16]:
jsd.to_json("partial_city.json",orient='records')